//////////////////////////////////////////////////////////////////////////
// 预编译文件
//////////////////////////////////////////////////////////////////////////
#include <Guiddef.h>
//////////////////////////////////////////////////////////////////////////
// USBIODEF
// 用来代替同名文件
//////////////////////////////////////////////////////////////////////////
/* f18a0e88-c30c-11d0-8815-00a0c906bed8 */  
DEFINE_GUID(GUID_DEVINTERFACE_USB_HUB,    0xF18A0E88, \
	0xC30C, 0x11D0, 0x88, 0x15, 0x00, 0xA0, 0xC9, 0x06, 0xBE, 0xD8);  

/* a5dcbf10-6530-11d2-901f-00c04fb951ed */  
DEFINE_GUID(GUID_DEVINTERFACE_USB_DEVICE, 0xA5DCBF10L, \
	0x6530, 0x11D2, 0x90, 0x1F, 0x00, 0xC0, 0x4F, 0xB9, 0x51, 0xED);  

/* 3abf6f2d-71c4-462a-8a92-1e6861e6af27 */  
DEFINE_GUID(GUID_DEVINTERFACE_USB_HOST_CONTROLLER, 0x3ABF6F2D, \
	0x71C4, 0x462A, 0x8A, 0x92, 0x1E, 0x68, 0x61, 0xE6, 0xAF, 0x27);  